betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_rcc.c
    tmpreg = RCC->CFGR0;
    tmpreg &= CFGR0_SW_Mask;
    tmpreg |= RCC_SYSCLKSource;
    RCC->CFGR0 = tmpreg;
}

/*********************************************************************
 * @fn      RCC_GetSYSCLKSource
 *
 * @brief   Returns the clock source used as system clock.
 *
 * @return  0x00 - HSI used as system clock.
 *          0x04 - HSE used as system clock.
 *          0x08 - PLL used as system clock.
 */
uint8_t RCC_GetSYSCLKSource(void)
{
    return ((uint8_t)(RCC->CFGR0 & CFGR0_SWS_Mask));
}

/*********************************************************************
 * @fn      RCC_HCLKSourceDivConfig
 *
 * @brief   Configures the HCLK clock .
 *
 * @param   RCC_SYSCLK - defines the HB clock divider. This clock is derived from
 *        the system clock (SYSCLK).
 *            RCC_SYSCLK_Div1 - Core1 clock = SYSCLK.
 *            RCC_SYSCLK_Div2 - Core1 clock = SYSCLK/2.
 *            RCC_SYSCLK_Div4 - Core1 clock = SYSCLK/4.
 *            RCC_SYSCLK_Div8 - Core1 clock = SYSCLK/8.
 *            RCC_SYSCLK_Div16 - Core1 clock = SYSCLK/16.
 *            RCC_SYSCLK_Div64 - Core1  clock = SYSCLK/64.
 *            RCC_SYSCLK_Div128 - Core1  clock = SYSCLK/128.
 *            RCC_SYSCLK_Div256 - Core1  clock = SYSCLK/256.
 *            RCC_SYSCLK_Div512 - Core1  clock = SYSCLK/512.
 *          RCC_SYSCLKFPRE - defines the FPRE clock divider. This clock is derived from
 *        the Core1 clock.
 *            RCC_SYSCLKFPRE_Div1 - HCLK clock = Core1 clock/1.
 *            RCC_SYSCLKFPRE_Div2 - HCLK clock = Core1 clock/2.
 *            RCC_SYSCLKFPRE_Div4 - HCLK clock = Core1 clock/4.
 *
 * @return  none
 */
void RCC_HCLKSourceDivConfig(uint32_t RCC_SYSCLK, uint32_t RCC_SYSCLKFPRE)
{
    uint32_t tmpreg = 0;

    tmpreg = RCC->CFGR0;
    tmpreg &= ~(RCC_HPRE | RCC_FPRE);
    tmpreg |= RCC_SYSCLK | RCC_SYSCLKFPRE;
    RCC->CFGR0 = tmpreg;
}

/*********************************************************************
 * @fn      RCC_TIMClockSourDivConfig
 *
 * @brief   TIMx - where x can be 1 to 10 to select the TIM peripheral.
 *          TIM_Clock_Divx -  defines the TIM clock divider
 *           TIM_Clock_Div2 - TIM_Clock = HCLK/2
 *           TIM_Clock_Div4 - TIM_Clock = HCLK/4
 *           TIM_Clock_Div8 - TIM_Clock = HCLK/8
 *
 * @return  none
 */
void RCC_TIMClockSourDivConfig(TIM_TypeDef * TIMx, uint32_t TIM_Clock_Divx)
{
   if((TIMx == TIM1) || (TIMx == TIM8) || (TIMx == TIM9) || (TIMx == TIM10))
   {
       RCC->CFGR0 &= ~RCC_PPRE2;
       RCC->CFGR0 |= TIM_Clock_Divx << 11;
   }
   else
   {
       RCC->CFGR0 &= ~RCC_PPRE1;
       RCC->CFGR0 |= TIM_Clock_Divx << 8;
   }
}

/*********************************************************************
 * @fn      RCC_LPTIMClockSourDivConfig
 *
 * @brief   LPTIM_Clock_Divx -  defines the LPTIM clock divider
 *           LPTIM_Clock_Div2 - LPTIM_Clock = HCLK/2
 *           LPTIM_Clock_Div4 - LPTIM_Clock = HCLK/4
 *           LPTIM_Clock_Div8 - LPTIM_Clock = HCLK/8
 *
 * @return  none
 */
void RCC_LPTIMClockSourDivConfig(uint32_t LPTIM_Clock_Divx)
{
    RCC->CFGR0 &= ~RCC_PPRE1;
    RCC->CFGR0 |= LPTIM_Clock_Divx << 8;
}

/*********************************************************************
 * @fn      RCC_ITConfig
 *
 * @brief   Enables or disables the specified RCC interrupts.
 *
 * @param   RCC_IT - specifies the RCC interrupt sources to be enabled or disabled.
 *            RCC_IT_LSIRDY - LSI ready interrupt.
 *            RCC_IT_LSERDY - LSE ready interrupt.
 *            RCC_IT_HSIRDY - HSI ready interrupt.
 *            RCC_IT_HSERDY - HSE ready interrupt.
 *            RCC_IT_PLLRDY - PLL ready interrupt.
 *            RCC_IT_ETHPLLRDY - ETH PLL ready interrupt.
 *            RCC_IT_SERDESPLLRDY - SERDES PLL ready interrupt.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_ITConfig(uint8_t RCC_IT, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        *(__IO uint8_t *)0x4002100D |= RCC_IT;
    }
    else
    {
        *(__IO uint8_t *)0x4002100D &= (uint8_t)~RCC_IT;
    }
}

/*********************************************************************
 * @fn      RCC_ADCUSBHSPLLCLKAsSourceConfig
 *
 * @brief   Configures the ADC clock (ADCCLK), the PLL clock source is USBHSPLL(480MHz).
 *
 * @param   RCC_PPRE - defines the ADC clock divider. This clock is derived from
 *        the USBHS_PLL_CLK clock .
 *          RCC_USBHS_5 - ADC clock = USBHS_PLL_CLK/5.
 *          RCC_USBHS_6 - ADC clock = USBHS_PLL_CLK/6.
 *          RCC_USBHS_7 - ADC clock = USBHS_PLL_CLK/7.
 *          RCC_USBHS_8 - ADC clock = USBHS_PLL_CLK/8.
 *          RCC_USBHS_9 - ADC clock = USBHS_PLL_CLK/9.
 *          RCC_USBHS_10 - ADC clock = USBHS_PLL_CLK/10.
 *          RCC_USBHS_11 - ADC clock = USBHS_PLL_CLK/11.
 *          RCC_USBHS_12 - ADC clock = USBHS_PLL_CLK/12.
 *          RCC_USBHS_13 - ADC clock = USBHS_PLL_CLK/13.
 *          RCC_USBHS_14 - ADC clock = USBHS_PLL_CLK/14.
 *          RCC_USBHS_15 - ADC clock = USBHS_PLL_CLK/15.
 *          RCC_USBHS_16 - ADC clock = USBHS_PLL_CLK/16.
 *          RCC_USBHS_17 - ADC clock = USBHS_PLL_CLK/17.
 *          RCC_USBHS_18 - ADC clock = USBHS_PLL_CLK/18.
 *          RCC_USBHS_19 - ADC clock = USBHS_PLL_CLK/19.
 *          RCC_USBHS_20 - ADC clock = USBHS_PLL_CLK/20.
 *          RCC_USBHS_21 - ADC clock = USBHS_PLL_CLK/21.
 *          RCC_USBHS_22 - ADC clock = USBHS_PLL_CLK/22.
 *          RCC_USBHS_23 - ADC clock = USBHS_PLL_CLK/23.
 *          RCC_USBHS_24 - ADC clock = USBHS_PLL_CLK/24.
 *          RCC_USBHS_25 - ADC clock = USBHS_PLL_CLK/25.
 *          RCC_USBHS_26 - ADC clock = USBHS_PLL_CLK/26.
 *          RCC_USBHS_27 - ADC clock = USBHS_PLL_CLK/27.
 *          RCC_USBHS_28 - ADC clock = USBHS_PLL_CLK/28.
 *          RCC_USBHS_29 - ADC clock = USBHS_PLL_CLK/29.
 *          RCC_USBHS_30 - ADC clock = USBHS_PLL_CLK/30.
 *          RCC_USBHS_31 - ADC clock = USBHS_PLL_CLK/31.
 *          RCC_USBHS_32 - ADC clock = USBHS_PLL_CLK/32.
 *          RCC_USBHS_33 - ADC clock = USBHS_PLL_CLK/33.
 *          RCC_USBHS_34 - ADC clock = USBHS_PLL_CLK/34.
 *          RCC_USBHS_35 - ADC clock = USBHS_PLL_CLK/35.
 *          RCC_USBHS_36 - ADC clock = USBHS_PLL_CLK/36.
 *
 * @return  none
 */
void RCC_ADCUSBHSPLLCLKAsSourceConfig(uint32_t RCC_PPRE)
{
    uint32_t tmpreg = 0;

