betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_rcc.c
    tmpreg = RCC->CFGR0;
    tmpreg &= ~(RCC_PPRE2 | RCC_ADCPRE);
    tmpreg |= (RCC_PPRE << 11);
    RCC->CFGR0 = tmpreg;
}

/*********************************************************************
 * @fn      RCC_ADCHCLKCLKAsSourceConfig
 *
 * @brief   Configures the ADC_clock (ADCCLK).
 *
 * @param   RCC_PPRE2_DIV - the PPRE2 clock divider. This clock is derived from
 *        the HCLK clock .
 *            RCC_PPRE2_DIV0 - HCLK.
 *            RCC_PPRE2_DIV2 - HCLK/2.
 *            RCC_PPRE2_DIV4 - HCLK/4.
 *            RCC_PPRE2_DIV8 - HCLK/8.
 *            RCC_PPRE2_DIV16 - HCLK/16.
 *          RCC_ADC_DIV - the ADC clock divider.
 *            RCC_HCLK_ADCPRE_DIV2 - ADC clock = HCLK/PPRE2_DIV/2.
 *            RCC_HCLK_ADCPRE_DIV4 - ADC clock = HCLK/PPRE2_DIV/4.
 *            RCC_HCLK_ADCPRE_DIV6 - ADC clock = HCLK/PPRE2_DIV/6.
 *            RCC_HCLK_ADCPRE_DIV8 - ADC clock = HCLK/PPRE2_DIV/8.
 *
 *          (ADC_Clock=HCLK/(RCC_PPRE2*RCC_ADCPRE))
 *
 * @return  none
 */
void RCC_ADCHCLKCLKAsSourceConfig(uint32_t RCC_PPRE2_DIV, uint32_t RCC_ADC_DIV)
{
    uint32_t tmpreg = 0;

    tmpreg = RCC->CFGR0;
    tmpreg &= ~(RCC_PPRE2 | RCC_ADCPRE);
    tmpreg |= (RCC_PPRE2_DIV << 11)|(RCC_ADC_DIV << 14);
    RCC->CFGR0 = tmpreg;
}

/*********************************************************************
 * @fn      RCC_LSEConfig
 *
 * @brief   Configures the External Low Speed oscillator (LSE).
 *
 * @param   RCC_LSE - specifies the new state of the LSE.
 *            RCC_LSE_OFF - LSE oscillator OFF.
 *            RCC_LSE_ON - LSE oscillator ON.
 *            RCC_LSE_Bypass - LSE oscillator bypassed with external clock.
 *
 * @return  none
 */
void RCC_LSEConfig(uint8_t RCC_LSE)
{
    *(__IO uint8_t *)0x40021024 = RCC_LSE_OFF;
    *(__IO uint8_t *)0x40021024 = RCC_LSE_OFF;

    switch(RCC_LSE)
    {
        case RCC_LSE_ON:
            *(__IO uint8_t *)0x40021024 = RCC_LSE_ON;
            break;

        case RCC_LSE_Bypass:
            *(__IO uint8_t *)0x40021024 = RCC_LSE_Bypass | RCC_LSE_ON;
            break;

        default:
            break;
    }
}

/*********************************************************************
 * @fn      RCC_LSICmd
 *
 * @brief   Enables or disables the Internal Low Speed oscillator (LSI).
 *          Note-
 *          LSI can not be disabled if the IWDG is running.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_LSICmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->RSTSCKR |= (1 << 0);
    }
    else
    {
        RCC->RSTSCKR &= ~(1 << 0);
    }
}

/*********************************************************************
 * @fn      RCC_RTCCLKConfig
 *
 * @brief   Once the RTC clock is selected it can't be changed unless the Backup domain is reset.
 *
 * @param   RCC_RTCCLKSource - specifies the RTC clock source.
 *            RCC_RTCCLKSource_LSE - LSE selected as RTC clock.
 *            RCC_RTCCLKSource_LSI - LSI selected as RTC clock.
 *            RCC_RTCCLKSource_HSE_Div512 - HSE clock divided by 128 selected as RTC clock.
 *         Note-   
 *           Once the RTC clock is selected it can't be changed unless the Backup domain is reset.
 *
 * @return  none
 */
void RCC_RTCCLKConfig(uint32_t RCC_RTCCLKSource)
{
    RCC->BDCTLR &= (~RCC_RTCCLKSource_HSE_Div512);
    RCC->BDCTLR |= RCC_RTCCLKSource;
}

/*********************************************************************
 * @fn      RCC_RTCCLKCmd
 *
 * @brief   This function must be used only after the RTC clock was selected
 *        using the RCC_RTCCLKConfig function.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_RTCCLKCmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->BDCTLR |= (1 << 8);
    }
    else
    {
        RCC->BDCTLR &= ~(1 << 8);
    }
}

/*********************************************************************
 * @fn      RCC_GetClocksFreq
 *
 * @brief   The result of this function could be not correct when using
 *        fractional value for HSE crystal.
 *
 * @param   RCC_Clocks - pointer to a RCC_ClocksTypeDef structure which will hold
 *        the clocks frequencies.
 *
 * @return  none
 */
void RCC_GetClocksFreq(RCC_ClocksTypeDef *RCC_Clocks)
{
    uint32_t tmp = 0,tmp1 = 0, tmp2 = 0, tmp3 = 0, pllmull = 0, pllsource = 0, presc = 0, presc1 = 0;

    tmp = RCC->CFGR0 & CFGR0_SWS_Mask;
    tmp2 = RCC->PLLCFGR & RCC_SYSPLL_SEL;

    switch(tmp)
    {
        case 0x00:
            RCC_Clocks->SYSCLK_Frequency = HSI_VALUE;
            break;

        case 0x04:
            RCC_Clocks->SYSCLK_Frequency = HSE_VALUE;
            break;

        case 0x08:
            switch(tmp2)
            { 
                case RCC_SYSPLL_PLL:
                    pllmull = RCC->PLLCFGR & RCC_PLLMUL;
                    pllsource = RCC->PLLCFGR & RCC_PLLSRC;
                    presc = (((RCC->PLLCFGR & RCC_PLL_SRC_DIV) >> 8) + 1);

                    if((pllsource == 0xE0) || (pllsource == 0xA0))
                    {
                        tmp1 = 500000000 / presc;
                    }
                    else if(pllsource == 0x80)
                    {
                        tmp1 = 480000000 / presc;
                    }
                    else if(pllsource == 0xC0)
                    {
                        tmp1 = 125000000 / presc;
                    }
                    else if(pllsource == 0x20)
                    {
                        tmp1 = HSE_VALUE / presc;
                    }
                    else
                    {
                        tmp1 = HSI_VALUE / presc;
                    }

                    if((pllmull == 4) || (pllmull == 6) || (pllmull == 8) || (pllmull == 10) || (pllmull == 12))
                    {
                        RCC_Clocks->SYSCLK_Frequency = (tmp1 * PLLMULTable[pllmull]) >> 1;
                    }
                    else
                    {
                        RCC_Clocks->SYSCLK_Frequency = tmp1 * PLLMULTable[pllmull];
                    }
                    break;

                case RCC_SYSPLL_USBHS:
                    RCC_Clocks->SYSCLK_Frequency = 480000000;
                    break;

