betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_rcc.c
                case RCC_SYSPLL_ETH:
                    RCC_Clocks->SYSCLK_Frequency = 500000000;
                    break;

                case RCC_SYSPLL_SERDES:
                    RCC_Clocks->SYSCLK_Frequency = 500000000;
                    break;

                case RCC_SYSPLL_USBSS:
                    RCC_Clocks->SYSCLK_Frequency = 125000000;
                    break;

                default:
                    RCC_Clocks->SYSCLK_Frequency = HSI_VALUE;
                    break;
            }  
            break;

        default:
            RCC_Clocks->SYSCLK_Frequency = HSI_VALUE;
            break;
    }

    tmp = (RCC->CFGR0 & CFGR0_HPRE_Set_Mask) >> 4;
    presc1 = HBPrescTable[tmp];

       tmp3 = RCC_Clocks->SYSCLK_Frequency >> presc1;
  
    
    tmp = (RCC->CFGR0 & RCC_FPRE) >> 16;
    presc1 = FPRETable[tmp];
    RCC_Clocks->HCLK_Frequency = tmp3 >> presc1;

    if(NVIC_GetCurrentCoreID() == 0)//V3F
    {
        RCC_Clocks->Core_Frequency = RCC_Clocks->HCLK_Frequency;
    }
    else 
    {
        RCC_Clocks->Core_Frequency = tmp3;
    }

    if((RCC->CFGR0 & RCC_ADCSRC) == RCC_ADCSRC)
    {
        RCC_Clocks->ADCCLK_Frequency = 480000000 / (((RCC->CFGR0 & 0xF800) >> 11) + 5);
    }
    else
    {
        tmp = (RCC->CFGR0 & RCC_PPRE2) >> 11;
        presc = PPRE2Table[tmp];
        RCC_Clocks->ADCCLK_Frequency = RCC_Clocks->HCLK_Frequency >> presc;
        tmp = (RCC->CFGR0 & RCC_ADCPRE) >> 14;
        presc = ADCPRETable[tmp];
        RCC_Clocks->ADCCLK_Frequency = RCC_Clocks->ADCCLK_Frequency / presc;  
    }
}

/*********************************************************************
 * @fn      RCC_HBPeriphClockCmd
 *
 * @brief   Enables or disables the HB peripheral clock.
 *
 * @param   RCC_HBPeriph - specifies the HB peripheral to gates its clock.
 *            RCC_HBPeriph_DMA1
 *            RCC_HBPeriph_DMA2
 *            RCC_HBPeriph_CRC
 *            RCC_HBPeriph_FMC
 *            RCC_HBPeriph_RNG
 *            RCC_HBPeriph_SDMMC
 *            RCC_HBPeriph_USBHS
 *            RCC_HBPeriph_USBSS
 *            RCC_HBPeriph_DVP
 *            RCC_HBPeriph_ETH
 *            RCC_HBPeriph_OTG_FS
 *            RCC_HBPeriph_UHSIF
 *            RCC_HBPeriph_USBPD
 *            RCC_HBPeriph_SERDES
 *            RCC_HBPeriph_POIC
 *         
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_HBPeriphClockCmd(uint32_t RCC_HBPeriph, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        RCC->HBPCENR |= RCC_HBPeriph;
    }
    else
    {
        RCC->HBPCENR &= ~RCC_HBPeriph;
    }
}

/*********************************************************************
 * @fn      RCC_HB2PeriphClockCmd
 *
 * @brief   Enables or disables the High Speed HB2 peripheral clock.
 *
 * @param   RCC_HB2Periph - specifies the HB2 peripheral to gates its clock.
 *            RCC_HB2Periph_AFIO
 *            RCC_HB2Periph_HSADC
 *            RCC_HB2Periph_GPIOA
 *            RCC_HB2Periph_GPIOB
 *            RCC_HB2Periph_GPIOC
 *            RCC_HB2Periph_GPIOD
 *            RCC_HB2Periph_GPIOE
 *            RCC_HB2Periph_GPIOF
 *            RCC_HB2Periph_ADC1
 *            RCC_HB2Periph_ADC2
 *            RCC_HB2Periph_TIM1
 *            RCC_HB2Periph_SPI1
 *            RCC_HB2Periph_TIM8
 *            RCC_HB2Periph_USART1
 *            RCC_HB2Periph_I2C4
 *            RCC_HB2Periph_SAI
 *            RCC_HB2Periph_SDIO
 *            RCC_HB2Periph_TIM9
 *            RCC_HB2Periph_TIM10
 *            RCC_HB2Periph_TIM11
 *            RCC_HB2Periph_TIM12
 *            RCC_HB2Periph_OPCM
 *            RCC_HB2Periph_DFSDM
 *            RCC_HB2Periph_ECDC
 *            RCC_HB2Periph_GPHA
 *            RCC_HB2Periph_LTDC
 *            RCC_HB2Periph_I3C
 *          NewState - ENABLE or DISABLE
 *
 * @return  none
 */
void RCC_HB2PeriphClockCmd(uint32_t RCC_HB2PCENR, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        RCC->HB2PCENR |= RCC_HB2PCENR;
    }
    else
    {
        RCC->HB2PCENR &= ~ RCC_HB2PCENR;
    }
}

/*********************************************************************
 * @fn      RCC_HB1PeriphClockCmd
 *
 * @brief   Enables or disables the Low Speed HB1 peripheral clock.
 *
 * @param   RCC_HB1Periph - specifies the HB1 peripheral to gates its clock.
 *            RCC_HB1Periph_TIM2
 *            RCC_HB1Periph_TIM3
 *            RCC_HB1Periph_TIM4
 *            RCC_HB1Periph_TIM5
 *            RCC_HB1Periph_TIM6
 *            RCC_HB1Periph_TIM7
 *            RCC_HB1Periph_USART6
 *            RCC_HB1Periph_USART7
 *            RCC_HB1Periph_USART8
 *            RCC_HB1Periph_LPTIM1
 *            RCC_HB1Periph_LPTIM2
 *            RCC_HB1Periph_WWDG
 *            RCC_HB1Periph_QSPI1
 *            RCC_HB1Periph_QSPI2
 *            RCC_HB1Periph_SPI2
 *            RCC_HB1Periph_SPI3
 *            RCC_HB1Periph_SPI4
 *            RCC_HB1Periph_USART2
 *            RCC_HB1Periph_USART3
 *            RCC_HB1Periph_USART4
 *            RCC_HB1Periph_USART5
 *            RCC_HB1Periph_I2C1
 *            RCC_HB1Periph_I2C2
 *            RCC_HB1Periph_CAN3
 *            RCC_HB1Periph_CAN1
 *            RCC_HB1Periph_CAN2
 *            RCC_HB1Periph_BKP
 *            RCC_HB1Periph_PWR
 *            RCC_HB1Periph_DAC
 *            RCC_HB1Periph_I2C3
 *            RCC_HB1Periph_SWPMI
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_HB1PeriphClockCmd(uint32_t RCC_HB1PCENR, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        RCC->HB1PCENR |= RCC_HB1PCENR;
    }
    else
    {
        RCC->HB1PCENR &= ~RCC_HB1PCENR;
    }
}

/*********************************************************************
 * @fn      RCC_HBPeriphResetCmd
 *
 * @brief   Forces or releases HB peripheral reset.
 *
 * @param   RCC_HBPeriph - specifies the HB peripheral to reset.
 *            RCC_HBPeriph_DMA1
 *            RCC_HBPeriph_DMA2
 *            RCC_HBPeriph_FMC
 *            RCC_HBPeriph_RNG
 *            RCC_HBPeriph_SDMMC
 *            RCC_HBPeriph_USBHS
 *            RCC_HBPeriph_USBSS
 *            RCC_HBPeriph_DVP
 *            RCC_HBPeriph_ETH
 *            RCC_HBPeriph_OTG_FS
 *            RCC_HBPeriph_UHSIF
 *            RCC_HBPeriph_USBPD
 *            RCC_HBPeriph_SERDES
 *            RCC_HBPeriph_POIC
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_HBPeriphResetCmd(uint32_t RCC_HBPeriph, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        RCC->HBPRSTR |= RCC_HBPeriph;
    }
    else
    {
        RCC->HBPRSTR &= ~RCC_HBPeriph;
    }
}

/*********************************************************************
 * @fn      RCC_HB2PeriphResetCmd
 *
 * @brief   Forces or releases High Speed HB2 peripheral reset.
 *
 * @param   RCC_HB2Periph - specifies the HB2 peripheral to reset.
 *            RCC_HB2Periph_AFIO
 *            RCC_HB2Periph_HSADC
 *            RCC_HB2Periph_IOPA
 *            RCC_HB2Periph_IOPB
 *            RCC_HB2Periph_IOPC
 *            RCC_HB2Periph_IOPD
 *            RCC_HB2Periph_IOPE
 *            RCC_HB2Periph_IOPF
 *            RCC_HB2Periph_ADC1
 *            RCC_HB2Periph_ADC2
 *            RCC_HB2Periph_TIM1
 *            RCC_HB2Periph_SPI1
 *            RCC_HB2Periph_TIM8
 *            RCC_HB2Periph_USART1
 *            RCC_HB2Periph_I2C4
 *            RCC_HB2Periph_SAI
 *            RCC_HB2Periph_SDIO
 *            RCC_HB2Periph_TIM9
 *            RCC_HB2Periph_TIM10
 *            RCC_HB2Periph_TIM11
 *            RCC_HB2Periph_TIM12
 *            RCC_HB2Periph_OPCM
 *            RCC_HB2Periph_DFSDM
 *            RCC_HB2Periph_ECDC
 *            RCC_HB2Periph_GPHA
 *            RCC_HB2Periph_LTDC
 *            RCC_HB2Periph_I3C
 *          NewState - ENABLE or DISABLE
 *
 * @return  none
 */
void RCC_HB2PeriphResetCmd(uint32_t RCC_HB2Periph, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        RCC->HB2PRSTR |= RCC_HB2Periph;
    }
    else
    {
        RCC->HB2PRSTR &= ~RCC_HB2Periph;
    }
}

/*********************************************************************
 * @fn      RCC_HB1PeriphResetCmd
 *
 * @brief   Forces or releases Low Speed HB1 peripheral reset.
 *
 * @param   RCC_HB1Periph - specifies the HB1 peripheral to reset.
 *            RCC_HB1Periph_TIM2
 *            RCC_HB1Periph_TIM3
 *            RCC_HB1Periph_TIM4
 *            RCC_HB1Periph_TIM5
 *            RCC_HB1Periph_TIM6
 *            RCC_HB1Periph_TIM7
 *            RCC_HB1Periph_USART6
 *            RCC_HB1Periph_USART7
 *            RCC_HB1Periph_USART8
 *            RCC_HB1Periph_LPTIM1
 *            RCC_HB1Periph_LPTIM2
 *            RCC_HB1Periph_WWDG
 *            RCC_HB1Periph_QSPI1
 *            RCC_HB1Periph_QSPI2
 *            RCC_HB1Periph_SPI2
 *            RCC_HB1Periph_SPI3
 *            RCC_HB1Periph_SPI4
 *            RCC_HB1Periph_USART2
 *            RCC_HB1Periph_USART3
 *            RCC_HB1Periph_USART4
 *            RCC_HB1Periph_USART5
 *            RCC_HB1Periph_I2C1
 *            RCC_HB1Periph_I2C2
 *            RCC_HB1Periph_CAN3
 *            RCC_HB1Periph_CAN1
 *            RCC_HB1Periph_CAN2
 *            RCC_HB1Periph_BKP
 *            RCC_HB1Periph_PWR
 *            RCC_HB1Periph_DAC
 *            RCC_HB1Periph_I2C3
 *            RCC_HB1Periph_SWPMI
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_HB1PeriphResetCmd(uint32_t RCC_HB1Periph, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        RCC->HB1PRSTR |= RCC_HB1Periph;
    }
    else
    {
        RCC->HB1PRSTR &= ~RCC_HB1Periph;
    }
}

/*********************************************************************
 * @fn      RCC_BackupResetCmd
 *
 * @brief   Forces or releases the Backup domain reset.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_BackupResetCmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->BDCTLR |= (1 << 16);
    }
    else
    {
        RCC->BDCTLR &= ~(1 << 16);
    }
}

/*********************************************************************
 * @fn      RCC_ClockSecuritySystemCmd
 *
 * @brief   Enables or disables the Clock Security System.
 *
 * @param   RCC_CSSHSEDIS - Enables or disables the Hardware shutdown of HSE and PLL.
 *            RCC_CSSHSEDIS_ENABLE - PLL will close when set CSSON (HSE have problem).
 *            RCC_CSSHSEDIS_DISABLE - Close CSSHSEDIS function
 *          RCC_CSSHSEDIS - Enables or disables the Clock Security System.
 *            RCC_CSSON_ENABLE - Open CSSON function
 *            RCC_CSSON_DISABLE -  Close CSSON function
 *
 * @return  none
 */
void RCC_ClockSecuritySystemCmd(uint8_t RCC_CSSHSEDIS, uint8_t RCC_CSSON_State)
{
    if(RCC_CSSHSEDIS)
    {
        RCC->CTLR |= (1 << 31);
    }
    else
    {
        RCC->CTLR &= ~(1 << 31);
    }

    if(RCC_CSSON_State)
    {
        RCC->CTLR |= (1 << 19);
    }
    else
    {
        RCC->CTLR &= ~(1 << 19);
    }
}

/*********************************************************************
 * @fn      RCC_MCOConfig
 *
 * @brief   Selects the clock source to output on MCO pin.
 *
 * @param   RCC_MCO - specifies the clock source to output.
 *            RCC_MCO_NoClock - No clock selected.
 *            RCC_MCO_SYSCLK - System clock selected.
 *            RCC_MCO_HSI - HSI oscillator clock selected.
 *            RCC_MCO_HSE - HSE oscillator clock selected.
 *            RCC_MCO_PLLCLK_Div2 - PLL clock divided by 2 selected
 *            RCC_MCO_UTMI - UTMI clock selected.
 *            RCC_MCO_USBSSPLL_Div2 -  USBSS PLL clock divided by 2 selected
 *            RCC_MCO_ETHPLL_Div8 - ETH PLL clock divided by 8 selected
 *            RCC_MCO_SERDESPLL_Div16 - SERDES PLL clock divided by 16 selected
 *
 * @return  none
 */
void RCC_MCOConfig(uint8_t RCC_MCO)
{
    *(__IO uint8_t *)0x40021007 = RCC_MCO;
}

/*********************************************************************
 * @fn      RCC_GetFlagStatus
 *
 * @brief   Checks whether the specified RCC flag is set or not.
 *
 * @param   RCC_FLAG - specifies the flag to check.
 *            RCC_FLAG_HSIRDY - HSI oscillator clock ready.
 *            RCC_FLAG_HSERDY - HSE oscillator clock ready.
 *            RCC_FLAG_PLLRDY - PLL clock ready.
 *            RCC_FLAG_SERDESPLLRDY - SERDES PLL clock ready.
 *            RCC_FLAG_ETHPLLRDY - ETH PLL clock ready.
 *            RCC_FLAG_USBSSPLLRDY - USBSS PLL clock ready.
 *            RCC_FLAG_USBHSPLLRDY - USBHS PLL clock ready.
 *            RCC_FLAG_LSERDY - LSE oscillator clock ready.
 *            RCC_FLAG_LSIRDY - LSI oscillator clock ready.
 *            RCC_FLAG_PINRST - Pin reset.
 *            RCC_FLAG_PORRST - POR/PDR reset.
 *            RCC_FLAG_SFTRST - Software reset.
 *            RCC_FLAG_IWDGRST - Independent Watchdog reset.
 *            RCC_FLAG_WWDGRST - Window Watchdog reset.
 *            RCC_FLAG_LKUPRSTF - Lockup reset.
 *
 * @return  FlagStatus - SET or RESET.
 */
FlagStatus RCC_GetFlagStatus(uint8_t RCC_FLAG)
{
    uint32_t tmp = 0;
    uint32_t statusreg = 0;

    FlagStatus bitstatus = RESET;
    tmp = RCC_FLAG >> 5;

    if(tmp == 1)
    {
        statusreg = RCC->CTLR;
    }
    else if(tmp == 2)
    {
        statusreg = RCC->BDCTLR;
    }
    else
    {
        statusreg = RCC->RSTSCKR;
    }

