betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_rcc.c
    tmp = RCC_FLAG & FLAG_Mask;

    if((statusreg & ((uint32_t)1 << tmp)) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*********************************************************************
 * @fn      RCC_ClearFlag
 *
 * @brief   Clears the RCC reset flags.
 *          Note-   
 *            The reset flags are: RCC_FLAG_PINRST, RCC_FLAG_PORRST, RCC_FLAG_SFTRST,
 *          RCC_FLAG_IWDGRST, RCC_FLAG_WWDGRST, RCC_FLAG_LKUPRSTF
 *
 * @return  none
 */
void RCC_ClearFlag(void)
{
    RCC->RSTSCKR |= RSTSCKR_RMVF_Set;
}

/*********************************************************************
 * @fn      RCC_GetITStatus
 *
 * @brief   Checks whether the specified RCC interrupt has occurred or not.
 *
 * @param   RCC_IT - specifies the RCC interrupt source to check.
 *            RCC_IT_LSIRDY - LSI ready interrupt.
 *            RCC_IT_LSERDY - LSE ready interrupt.
 *            RCC_IT_HSIRDY - HSI ready interrupt.
 *            RCC_IT_HSERDY - HSE ready interrupt.
 *            RCC_IT_PLLRDY - PLL ready interrupt.
 *            RCC_IT_SERDESPLLRDY - SERDES PLL ready interrupt.
 *            RCC_IT_ETHPLLRDY - ETH PLL ready interrupt.
 *            RCC_IT_CSSF - Clock Security System interrupt.
 *
 * @return  ITStatus - SET or RESET.
 */

ITStatus RCC_GetITStatus(uint8_t RCC_IT)
{
    ITStatus bitstatus = RESET;

    if((RCC->INTR & RCC_IT) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*********************************************************************
 * @fn      RCC_ClearITPendingBit
 *
 * @brief   Clears the RCC's interrupt pending bits.
 *
 * @param   RCC_IT - specifies the interrupt pending bit to clear.
 *            RCC_IT_LSIRDY - LSI ready interrupt.
 *            RCC_IT_LSERDY - LSE ready interrupt.
 *            RCC_IT_HSIRDY - HSI ready interrupt.
 *            RCC_IT_HSERDY - HSE ready interrupt.
 *            RCC_IT_PLLRDY - PLL ready interrupt.
 *            RCC_IT_SERDESPLLRDY - SERDES PLL ready interrupt.
 *            RCC_IT_ETHPLLRDY - ETH PLL ready interrupt.
 *            RCC_IT_CSSF - Clock Security System interrupt.
 *
 * @return  none
 */
void RCC_ClearITPendingBit(uint8_t RCC_IT)
{
    *(__IO uint8_t *)0x4002100E = RCC_IT;
}

/*********************************************************************
 * @fn      RCC_USBHS_PLLCmd
 *
 * @brief   ENABLE or DISABLE USBHS PLL Clock.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_USBHS_PLLCmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CTLR |= RCC_USBHS_PLLON;
    }
    else
    {
        RCC->CTLR &= ~RCC_USBHS_PLLON;
    }
}

/*********************************************************************
 * @fn      RCC_USBSS_PLLCmd
 *
 * @brief   ENABLE or DISABLE USBSS PLL Clock.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_USBSS_PLLCmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CTLR |= RCC_USBSS_PLLON;
    }
    else
    {
        RCC->CTLR &= ~RCC_USBSS_PLLON;
    }
}

/*********************************************************************
 * @fn      RCC_ETH_PLLCmd
 *
 * @brief   ENABLE or DISABLE ETH PLL Clock.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_ETH_PLLCmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CTLR |= RCC_ETH_PLLON;
    }
    else
    {
        RCC->CTLR &= ~RCC_ETH_PLLON;
    }
}

/*********************************************************************
 * @fn      RCC_SERDES_PLLCmd
 *
 * @brief   ENABLE or DISABLE SERDES PLL Clock.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_SERDES_PLLCmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CTLR |= RCC_SERDES_PLLON;
    }
    else
    {
        RCC->CTLR &= ~RCC_SERDES_PLLON;
    }
}

/*********************************************************************
 * @fn      RCC_PIPEcmd
 *
 * @brief   ENABLE or DISABLE PIPE.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_PIPECmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CFGR0 |= RCC_PIPEON;
    }
    else
    {
        RCC->CFGR0 &= ~RCC_PIPEON;
    }
}

/*********************************************************************
 * @fn      RCC_UTMIcmd
 *
 * @brief   ENABLE or DISABLE UTMI.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_UTMIcmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CFGR0 |= RCC_UTMION;
    }
    else
    {
        RCC->CFGR0 &= ~RCC_UTMION;
    }
}

/*********************************************************************
 * @fn      RCC_RGMIIcmd
 *
 * @brief   ENABLE or DISABLE RGMII.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_RGMIIcmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CFGR0 |= RCC_RGMIION;
    }
    else
    {
        RCC->CFGR0 &= ~RCC_RGMIION;
    }
}

/*********************************************************************
 * @fn      RCC_ETH125MCLKConfig
 *
 * @brief   Configures the ETH125M clock source.
 *
 * @param   RCC_ETH125MMSource - !000M ETH's 125M clock source. 
 *            RCC_ETH125MSource_PLLCLK - PLLCLK clock selected as ETH clock 125MHz  clock entry
 *            RCC_ETH125MSource_USBSS - USBSS_PLL clock selected as ETH clock 125MHz  clock entry
 *            RCC_ETH125MSource_ETH_Div4 - ETH_PLL_Div4 clock selected as ETH clock 125MHz  clock entry
 *            RCC_ETH125MSource_SERDES_Div8 - SERDES_PLL_Div8 clock selected as ETH clock 125MHz  clock entry
 *
 * @return  none
 */
void RCC_ETH125MCLKConfig(uint32_t RCC_ETH125MMSource)
{
    RCC->CFGR2 &= ~RCC_ETH1GSRC;
    RCC->CFGR2 |= (RCC_ETH125MMSource << 30);
}

/*********************************************************************
 * @fn      RCC_HSADCCLKConfig
 *
 * @brief   Configures the HSADC Clock source.
 *
 * @param   RCC_HSADCSource - specifies the HSADC source.
 *            RCC_HSADCSource_PLLCLK - PLLCLK clock selected as HSADC clock entry
 *            RCC_HSADCSource_SYSCLK - SYSCLK clock selected as HSADC clock entry
 *            RCC_HSADCSource_USBHS - USBHS clock selected as HSADC clock entry
 *            RCC_HSADCSource_ETH - TTH clock selected as HSADC clock entry
 *
 * @return  none
 */
void RCC_HSADCCLKConfig(uint32_t RCC_HSADCSource)
{
    RCC->CFGR2 &= ~RCC_HSADCSRC;
    RCC->CFGR2 |= (RCC_HSADCSource << 28);
}

/*********************************************************************
 * @fn      RCC_I2S3CLKConfig
 *
 * @brief   Configures the I2S3 clock source(I2S23CLK).
 *
 * @param   RCC_I2S3CLKSource - specifies the I2S3 clock source.
 *            RCC_I2S3CLKSource_SYSCLK - system clock selected as I2S3 clock entry
 *            RCC_I2S3CLKSource_PLLCLK - PLL clock selected as I2S3 clock entry
 *          
 * @return  none
 */
void RCC_I2S3CLKConfig(uint32_t RCC_I2S3CLKSource)
{
    RCC->CFGR2 &= ~RCC_I2S3SRC;
    RCC->CFGR2 |= (RCC_I2S3CLKSource << 25);
}

/*********************************************************************
 * @fn      RCC_I2S2CLKConfig
 *
 * @brief   Configures the I2S2 clock source(I2S2CLK).
 *
 * @param   RCC_I2S2CLKSource - specifies the I2S2 clock source.
 *            RCC_I2S2CLKSource_SYSCLK - system clock selected as I2S2 clock entry
 *            RCC_I2S2CLKSource_PLLCLK - PLLclock selected as I2S2 clock entry
 *          
 * @return  none
 */
void RCC_I2S2CLKConfig(uint32_t RCC_I2S2CLKSource)
{
    RCC->CFGR2 &= ~RCC_I2S2SRC;
    RCC->CFGR2 |= (RCC_I2S2CLKSource << 24);
}

/*********************************************************************
 * @fn      RCC_RNGCLKConfig
 *
 * @brief   Configures the RNG clock source.
 *
 * @param   RCC_RNGCLKSource - specifies the RNG clock source.
 *            RCC_RNGCLKSource_SYSCLK - system clock selected as RNG clock entry
 *            RCC_RNGCLKSource_PLLCLK - PLL clock selected as RNG clock entry
 *
 * @return  none
 */
void RCC_RNGCLKConfig(uint32_t RCC_RNGCLKSource)
{
    RCC->CFGR2 &= ~RCC_RNGSRC;
    RCC->CFGR2 |= (RCC_RNGCLKSource << 23);
}

/*********************************************************************
 * @fn      RCC_USBFSCLKConfig
 *
 * @brief   Configures the USBFS clock source.
 *
 * @param   RCC_USBFSCLKSource - specifies the RNG clock source.
 *            RCC_USBFSCLKSource_USBHSPLL - USBHS PLL clock selected as USBFS_48M clock entry
 *            RCC_USBFSCLKSource_PLL - PLL clock selected as USBFS_48M clock entry
 *
 * @return  none
 */
void RCC_USBFSCLKConfig(uint32_t RCC_USBFSCLKSource)
{
    RCC->CFGR2 &= ~RCC_USBFSSRC;
    RCC->CFGR2 |= (RCC_USBFSCLKSource << 20);
}

/*********************************************************************
 * @fn      RCC_USBFS48ClockSourceDivConfig
 *
 * @brief   Configures the USBFS clock Source Division.
 *
 * @param   RCC_USBFS_DIV - USBFS clock Source Division.
 *            RCC_USBFS_Divx - x can select(1,2,3,4,5,6,8,10,1.5,2.5,3.5,4.5,
 *               5.5,6.5,7.5,9.5)
 *
 * @return  none
 */
void RCC_USBFS48ClockSourceDivConfig(uint32_t RCC_USBFS_DIV)
{
    RCC->CFGR2 &= ~RCC_USBFSDIV;
    RCC->CFGR2 |= (RCC_USBFS_DIV << 16);
}

/*********************************************************************
 * @fn      RCC_LTDCCLKConfig
 *
 * @brief   Configures the LTDC clock source.
 *
 * @param   RCC_LTDCClockSource - the LTDC clock source.
 *            RCC_LTDCClockSource_PLL - HCLK clock selected as LTDC clock entry
 *            RCC_LTDCClockSource_SERDESPLL - SERDES PLL clock selected as LTDC clock entry
 *            RCC_LTDCClockSource_ETHPLL - ETH PLL clock selected as LTDC clock entry
 *            RCC_LTDCClockSource_USBHSPLL - USBHS PLL clock selected as LTDC clock entry
 *
 * @return  none
 */
void RCC_LTDCCLKConfig(uint32_t RCC_LTDCClockSource)
{
    RCC->CFGR2 &= ~RCC_LTDCSRC;
    RCC->CFGR2 |= (RCC_LTDCClockSource << 14);
}

/*********************************************************************
 * @fn      RCC_LTDCClockSourceDivConfig
 *
 * @brief   Configures the LTDC clock Source Division.
 *
 * @param   RCC_LTDCClockSource_Div - the LTDC clock Source Division
 *            RCC_LTDCClockSource_Divx - x can select(1~64)
 *
 * @return  none
 */
void RCC_LTDCClockSourceDivConfig(uint32_t RCC_LTDCClockSource_Div)
{
    RCC->CFGR2 &= ~RCC_LTDCDIV;
    RCC->CFGR2 |= RCC_LTDCClockSource_Div << 8;
}

/*********************************************************************
 * @fn      RCC_UHSIFCLKConfig
 *
 * @brief   Configures the UHSIF clock source.
 *
 * @param   RCC_UHSIFClockSource - the UHSIF clock source.
 *            RCC_UHSIFClockSource_SYSCLK - system clock as the UHSIF clock source 
 *            RCC_UHSIFClockSource_PLL - PLL as the UHSIF clock source
 *            RCC_UHSIFClockSource_USBHSPLL - USBHS PLL as  the UHSIF clock source
 *            RCC_UHSIFClockSource_ETHPLL - ETH PLL as  the UHSIF clock source
 *
 * @return  none
 */
void RCC_UHSIFCLKConfig(uint32_t RCC_UHSIFClockSource)
{
    RCC->CFGR2 &= ~RCC_UHSIFSRC;
    RCC->CFGR2 |= (RCC_UHSIFClockSource << 6);
}

/*********************************************************************
 * @fn      RCC_UHSIFClockSourceDivConfig
 *
 * @brief   Configures the UHSIF clock Source Division.
 *
 * @param   RCC_UHSIFClockSource_Div - the UHSIF clock Source Division.
 *            RCC_UHSIFClockSource_Divx - x can select(1~64)
 *
 * @return  none
 */
void RCC_UHSIFClockSourceDivConfig(uint32_t RCC_UHSIFClockSource_Div)
{
    RCC->CFGR2 &= ~RCC_UHSIFDIV ;
    RCC->CFGR2 |= RCC_UHSIFClockSource_Div;
}

/*********************************************************************
 * @fn      RCC_USBHSPLLCLKConfig
 *
 * @brief   Configures the USBHS PLL clock source.
 *
 * @param   RCC_USBHSPLLSource - the USBHS clock source.
 *            RCC_USBHSPLLSource_HSE - HSE clock selected as USBHS PLL clock entry
 *            RCC_USBHSPLLSource_HSI - HSI clock selected as USBHS PLL clock entry
 *            RCC_USBHSPLLSource_20METH  - ETH 20M clock selected as USBHS PLL clock entry
 *            RCC_USBHSPLLSource_PLL_CLK_DIV - PLL_CLK division clock selected as USBHS PLL clock entry
 *
 * @return  none
 */
void RCC_USBHSPLLCLKConfig(uint32_t RCC_USBHSPLLSource)
{
    RCC->PLLCFGR2 &= ~RCC_USBHSPLLSRC;
    RCC->PLLCFGR2 |= RCC_USBHSPLLSource;
}

/*********************************************************************
 * @fn      RCC_USBHSPLLReferConfig
 *
 * @brief   Configures the USBHS PLL refer clock.
 *
 * @param   RCC_USBHSPLLRefer - the USBHS PLL refer clock.
 *            RCC_USBHSPLLRefer_25M - USBHS PLL Refer clock 25M
 *            RCC_USBHSPLLRefer_20M - USBHS PLL Refer clock 20M
 *            RCC_USBHSPLLRefer_24M  - USBHS PLL Refer clock 24M
 *            RCC_USBHSPLLRefer_32M - USBHS PLL Refer clock 32M
 *
 * @return  none
 */
void RCC_USBHSPLLReferConfig(uint32_t RCC_USBHSPLLRefer)
{
    RCC->PLLCFGR2 &= ~RCC_USBHSPLL_REFSEL;
    RCC->PLLCFGR2 |= RCC_USBHSPLLRefer;
}

/*********************************************************************
 * @fn      RCC_USBSSPLLReferConfig
 *
 * @brief   Configures the USBSS PLL refer clock.
 *
 * @param   RCC_USBSSPLLRefer - the USBSS PLL refer clock.
 *            RCC_USBSSPLLRefer_20M - USBSS PLL Refer clock 20M
 *            RCC_USBSSPLLRefer_24M - USBSS PLL Refer clock 24M
 *            RCC_USBSSPLLRefer_25M - USBSS PLL Refer clock 25M
 *            RCC_USBSSPLLRefer_30M - USBSS PLL Refer clock 30M
 *            RCC_USBSSPLLRefer_32M - USBSS PLL Refer clock 32M
 *            RCC_USBSSPLLRefer_40M - USBSS PLL Refer clock 40M
 *            RCC_USBSSPLLRefer_60M - USBSS PLL Refer clock 60M
 *            RCC_USBSSPLLRefer_80M - USBSS PLL Refer clock 80M
 *
 * @return  none
 */
void RCC_USBSSPLLReferConfig(uint32_t RCC_USBSSPLLRefer)
{
    RCC->PLLCFGR2 &= ~RCC_USBSSPLL_REFSEL;
    RCC->PLLCFGR2 |= RCC_USBSSPLLRefer;
}

/*********************************************************************
 * @fn      RCC_USBHSPLLClockSourceDivConfig
 *
 * @brief   Configures the USBHS PLL source clock division.
 *
 * @param   RCC_USBHSPLL_IN_Div - the USBHS PLL source clock division.
 *            RCC_USBHSPLL_IN_Divx - x can select(1~32)
 *
 * @return  none
 */
void RCC_USBHSPLLClockSourceDivConfig(uint32_t RCC_USBHSPLL_IN_Div)
{
    RCC->PLLCFGR2 &= ~RCC_USBHSPLL_IN_DIV;
    RCC->PLLCFGR2 |= RCC_USBHSPLL_IN_Div;
}

/*********************************************************************
 * @fn      RCC_SERDESPLLMulConfig
 *
 * @brief   Configures the SERDES PLL Mul.
 *
 * @param   RCC_SERDESMul_25 - the SERDES PLL Mul.
 *            RCC_SERDESPLLMul_x - x can select(25,28,30,32,35,38,40,45,50,
 *       56,60,64,70,76,80,90)
 *          
 * @return  none
 */
void RCC_SERDESPLLMulConfig(uint32_t RCC_SERDESPLLMul)
{
    RCC->PLLCFGR2 &= ~RCC_SERDESPLL_MUL;
    RCC->PLLCFGR2 |= (RCC_SERDESPLLMul << 16);
}

/*********************************************************************
 * @fn      RCC_ADCCLKDutyCycleConfig
 *
 * @brief   Configures the ADC clock high level duty cycle.
 *
 * @param   RCC_DutyCycle - high level duty cycle.
 *            RCC_ADC_H_Level_Mode0 - ADC clock high-level duty cycle is mode 0.
 *            RCC_ADC_H_Level_Mode1 - ADC clock high-level duty cycle is mode 1.
 *
 * @return  none
 */
void RCC_ADCCLKDutyCycleConfig(uint32_t RCC_DutyCycle)
{
    RCC->CFGR0 &= ~RCC_ADC_DUTY_SEL;
    RCC->CFGR0 |= RCC_DutyCycle;
}

/*********************************************************************
 * @fn      RCC_ADCCLKConfig
 *
 * @brief   Configures the ADC clock source.
 *
 * @param   RCC_ADCCLKSource - specifies the RNG clock source.
 *            RCC_ADCCLKSource_HCLK -  HCLK clock selected as ADC clock entry
 *            RCC_ADCCLKSource_USBHSPLL - USBHS PLL clock selected as ADC clock entry
 *
 * @return  none
 */
void RCC_ADCCLKConfig(uint32_t RCC_ADCCLKSource)
{
    RCC->CFGR2 &= ~RCC_ADCSRC;
    RCC->CFGR2 |= (RCC_ADCCLKSource << 31);
}

/*********************************************************************
 * @fn      RCC_SYSPLLGATEcmd
 *
 * @brief   ENABLE or DISABLE System clock  gate.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void RCC_SYSPLLGATEcmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->PLLCFGR |= RCC_SYSPLL_GATE;
    }
    else
    {
        RCC->PLLCFGR &= ~RCC_SYSPLL_GATE;
    }
}

/*********************************************************************
 * @fn      RCC_SYSPLLConfig
 *
 * @brief   Configures the System PLL clock source.
 *
 * @param   RCC_SYSPLLClockSource - the System PLL clock source.
 *            RCC_SYSPLLClockSource_PLL - PLL clock selected as System PLL clock entry
 *            RCC_SYSPLLClockSource_USBHSPLL - USBHS PLL clock selected as System PLL clock entry
 *            RCC_SYSPLLClockSource_ETHPLL - ETH PLL clock selected as System PLL clock entry
 *            RCC_SYSPLLClockSource_SERDESPLL - SERDES PLL clock selected as System PLL clock entry
 *            RCC_SYSPLLClockSource_USBSSPLL - USBSS PLL clock selected as System PLL clock entry
 *
 * @return  none
 */
void RCC_SYSPLLConfig(uint32_t RCC_SYSPLLClockSource)
{
    RCC->PLLCFGR &= ~RCC_SYSPLL_SEL;
    RCC->PLLCFGR |= (RCC_SYSPLLClockSource << 28);
}
